<html>
<head>
	<meta http-equiv="X-UA-Compatible" content="IE=edge" />
	<meta http-equiv="Content-Type" content="text/html; charset=UTF-8" />
	<meta name="viewport" content="width=device-width, initial-scale=1, minimum-scale=1" />
	<title>우영우 자기소개 | 길호넷</title>
	<link rel="stylesheet" href="https://webfontworld.github.io/NexonLv2Gothic/NexonLv2Gothic.css">
	<link rel="stylesheet" href="./css/style.css?_t=202208290539">
	<script src="https://unpkg.com/typeit@8.7.0/dist/index.umd.js"></script>
</head>
<body>
	<div class="box">
		<p id="message"></p>
	</div>

	<script>
	window.onload = function() 
	{
		new TypeIt("#message", {
			afterStep: async () => { window.scrollTo(0, document.body.scrollHeight); },
			afterComplete: async () => { window.scrollTo(0, document.body.scrollHeight); },
			speed: 50,
			waitUntilVisible: true,
		})
		.type("제 이름은 똑바로 읽어도 거꾸로 읽어도 우영우입니다.", { delay: 300 })
		.break({ delay: 250 })
		.break({ delay: 250 })
		.type("기러기, 토마토, 스위스, 인도인, 별똥별, 우영우", { delay: 500 })
		.delete(3)
		.options({ speed: 25 })
		.type("가불가, 각일각, 감찰감, 강인강,")
		.options({ speed: 5 })
		.type("개조개, 견취견, 경덕경, 경신경, 고마고, 고조고, 곡중곡, 공기공, 공대공, 관계관, 관리관, 관음관, 관할관, 구명구, 구북구, 구약구, 국적국, 군위군, 균핵균, 극광극, 극중극, 글말글, 금도금, 금박금, 금지금, 금해금, 기계기, 기능기, 기동기, 기러기, 기록기, 기름기, 기린기, 기모기, 기보기, 기본기, 기시기, 기애기, 기울기, 기음기, 기전기, 기중기, 기진기, 기화기, 기흉기, 긴막긴, 긴불긴, 네리네, 능불능, 다대다, 다우다, 다후다, 당부당, 대구대, 대륙대, 대부대, 대젓대, 도구도, 도마도, 도성도, 도착도, 돌난돌, 동남동, 동북동, 들버들, 뜸대뜸, 뜸통뜸, 라퀼라, 라훌라, 로물로, 르나르, 르포르, 마그마, 마나마, 맨투맨, 메리메, 몽중몽, 무고무, 무당무, 무애무, 문살문, 문소문, 문어문, 바가바, 바나바, 바라바, 박지박, 반깃반, 반도반, 반월반, 반의반, 반지반, 밭벼밭, 백동백, 번하번, 법지법, 법화법, 변지변, 별똥별, 병상병, 보강보, 보노보, 복불복, 봉수봉, 봉천봉, 부관부, 부마부, 부익부, 비가비, 비례비, 비상비, 비수비, 비약비, 비열비, 빈익빈, 빙하빙, 사고사, 사동사, 사라사, 사례사, 사말사, 사무사, 사본사, 사성사, 사옥사, 사은사, 사임사, 사적사, 사진사, 사합사, 삭즉삭, 산방산, 산소산, 산화산, 살몸살, 상극상, 상문상, 상산상, 상지상, 생고생, 서남서, 서북서, 서약서, 석류석, 석반석, 석판석, 석필석, 석회석, 선급선, 선불선, 선상선, 선율선, 선종선, 성관성, 성명성, 성불성, 성실성, 소개소, 소독소, 소매소, 소변소, 소어소, 손짭손, 송자송, 수간수, 수급수, 수반수, 수부수, 수분수, 수비수, 수양수, 수징수, 수축수, 수화수, 스미스, 스위스, 스탠스, 스텔스, 스팍스, 시사시, 시엠시, 시첩시, 시흥시, 신하신, 실버실, 실불실, 실습실, 실험실, 심사심, 아노아, 아래아, 아리아, 아미아, 아세아, 아시아, 암산암, 약면약, 양휘양, 엘디엘, 역무역, 열대열, 염산염, 염소염, 오디오, 오지오, 옥상옥, 옥섭옥, 왕중왕, 용불용, 우궁우, 우부우, 우저우, 우향우, 원로원, 원명원, 위불위, 위축위, 유압유, 유피유, 윤대윤, 윤동윤, 이사이, 이시이, 이심이, 이앓이, 이자이, 이준이, 이지이, 이총이, 인과인, 인기인, 인도인, 인비인, 인쇄인, 인수인, 일관일, 일대일, 일양일, 일요일, 일주일, 자격자, 자사자, 자살자, 자수자, 자원자, 자유자, 자음자, 좌향좌, 작은작, 장발장, 장식장, 장의장, 장천장, 장치장, 장파장, 적극적, 적대적, 적부적, 전간전, 전격전, 전면전, 전모전, 전반전, 전복전, 전용전, 전자전, 전차전, 전초전, 전파전, 정결정, 정과정, 정수정, 정찰정, 제사제, 제산제, 제암제, 제주제, 제초제, 천정천, 청중청, 초장초, 층단층, 친막친, 친불친, 카나카, 카프카, 크랭크, 크리크, 탁중탁, 탄도탄, 토론토, 토스토, 통보통, 통신통, 통풍통, 트렌트, 트로트, 티엔티, 파리파, 파스파, 파열파, 편불편, 포경포, 표지표, 피시피, 피오피, 하지하, 합집합, 항공항, 행불행, 향기향, 현천현, 호모호, 호불호, 화석화, ", { delay: 300})
		.type("우영우...", { delay: 500})
		.delete(8)
		.break({ delay: 250 })
		.break({ delay: 250 })
		.options({ speed: 80 })
		.type("우영우...", { delay: 500})
		.delete(3)
		.type(", <em>역삼역?</em>")
		.break()
		.go();
	}
	</script>
</body>
</html>